app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bbbbbbbbbbbb"], ["body", "bbbbbbbbbbbbb"], ["user_id", 3], ["created_at", "2020-07-11 06:24:01.137097"], ["updated_at", "2020-07-11 06:24:01.137097"]]
---
def create
	book = Book.new(book_params)
	book.user_id = current_user.id
	book.save

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
def show
	@book = Book.new
	@books = Book.all
	@user = User.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
def edit
	@book = Book.find(params[:id])
	@user = User.find(params[:id])