app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
		if @book.save
			flash[:notice] = 'You have created book successfully.'
			redirect_to book_path(@book.id)
		else
			@books = Book.all