app/controllers/users_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@book = Book.find(params[:id])
		@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "fijosdjaio"], ["updated_at", "2020-07-13 10:36:35.411557"], ["id", 20]]
---
	def update
		book = book.find(params[:id])
		book.update(book_params)
		redirect_to book_path
		@user = User.find(params[:id])
		@user.update(user_params)